# 1、 将 0001 1010 转换成十进制。

# 2、 将 42 转换成二进制。

# 3、 显示 4、5、42,转换成二进制后的长度。

# 4、 bool str int 三种类型互换。

# 5、 判断，用户有输入显示 “有内容”， 没输入内容，显示 “无内容” 。

# 6、写出下列变量 s2、s3、s4、s5、s6、s7、s8的值
# s1 = 'python全栈22期'
# s2 = s1[0]
# print(s2,type(s2))
# s3 = s1[2]
# print(s3)
# s4 = s1[-1]
# print(s4)
# s5 = s1[0:6]
# s5 = s1[:6]
# print(s5)
# s6 = s1[6:]
# print(s6)
# s7 = s1[:5:2]
# print(s7)
# print(s1[:])
# s8 = s1[-1:-6:-1]
# print(s8)

# 7、倒序全部取出来：
# s = 'taiBAIfdsa'

# 8、将变量 s 转换成全部大写、全部小写
# s = 'taiBAIfdsa'

# 9、判断用户登陆、验证码不区分大小写。

# 10、判断变量 s 是不是 t 开头，是不是 taiBAI 开头，3至6的字符是不是以 B 开头。
# s = 'taiBAIfdsa'

# 11、现有变量  msg = 'alex 很nb,alex是老男孩教育的创始人之一，alex长得很帅'
#  将其中的 'alex' 全部替换成 '太白' ; 将其中的前两个 'alex' 替换成 '太白'

# 12、去掉变量  s4 = ' \n太r白\t'  的前后空白字符，只去除其中的部分字符：qrsed

# 13、按 ： 对变量 s6 = '太白:女神:吴超' 进行分隔

# 14、 按 ： 对变量 s6 = ':barry:nvshen:wu:liu' 进行分隔；按 ： 对变量 s6 只分隔前两个。

# 15、用 + 连接 s1 = 'alex' 的每一个字母。

# 16、 用 ： 连接 列表 l1 = ['太白','女神','吴超'] 的各个元素。

# 17、读懂下列语句
# s1 = '老男孩edu'
# print('老' in s1)
# print('老男' in s1)
# print('老ed' in s1)
# print('老ed' not in s1)

# 18、用while迭代打印 s1 = '老男孩教育最好的讲师：太白'

# 19、用for迭代打印 s1 = '老男孩教育最好的讲师：太白'

# 20、用for迭代打印 s1 = '老男孩教育最好的讲师：太白' ,只打印至 '好'，余下的不打。
