
# 1、打印 'hello world 老铁'

# 2、打印 1+2+3+4+5 的和。

# 3、用变量打印 1+2+3+4+5 ，（1+2+3+4+5)*3/2， (((1+2+3+4+5)*3/2）+100）/24

# 4、下列变量定义，哪些是合法的，哪些是不合法的。
"""
x8 = 100
b__ = 12
4g = 32
_ = 11
*r = 12
r3t4 = 10
t_ = 66
"""

# 5、下面的程序输出结果是什么？
'''
age1 = 18
age2 = age1
age3 = age2
age2 = 12
print(age1,age2,age3) 
'''

# 6、定义并打印一个常量

# 7、下面的程序输出结果是什么？
'''
i = 100
i1 = 2
i2 = i*i1
print(i2)
'''

# 8、分别用3个符号定义3个字符变量

# 9、定义字符变量，变量的值是：I'am taibai, 18 years old.

# 10、用一首诗做为一个变量的值，并打印这个变量。

# 11、定义2个字符变量，验证字符串的 +，* 两种运算。

# 12、说出下面的打印结果：
'''
print(2 > 1)
print(3 < 1)
print(True)
print('True')
'''

# 13、验证： input: 出来的全部都是字符串类型。

# 14、让用户输入姓名、年龄、性别，然后打印一句话‘我叫：  ，今年： ，性别： ’

# 15、

