# 1、用while循环写用户登陆（用户名、密码、验证码），3次不成功则退出。

# 2、打印 1-100 所有的数字

# 3、打印 1+2+3......100 的结果：

# 4、打印 1-100 所有偶数的和：

# 5、continue 退出本次循环，继续下一次循环

# 6、while else:   while 循环如果被 break 打断，则不执行 else 语句。

# 7、制作一个公共的模板，让一个字符串的某些位置变成动态可传入的。
"""
-------- info of 太白金星 --------
name : 太白金星
age  : 18
job  : Teacher
Hobbie: girl
-------- end --------
"""


# 8、用占位符 % 输出 ”我叫 太白金星, 今年 18, 学习进度 1%" ,其中 1%不用占位符


# 9、判断下面的打印结果：
"""
i1 = 2
i2 = 3
print(2 ** 3)
print(10//3)
print(10 % 3)

print(3 != 4)

count = 1
count = count + 1
count += 1
print(count)
"""

# 10、 判断下面的打印结果：
'''
print(2 > 1 and 3 < 4 or 4 > 5 and 2 < 1)
print(True or False)
'''

# 11、判断打印结果：
'''
print(1 or 2)
print(3 or 2)
print(4 or 2)
print(-1 or 2)
print(0 or 2)
print(1 and 2)
'''

# 12、判断结果：
'''
s1 = '00100'
print(int(s1))

i1 = 100
print(str(i1),type(str(i1)))

i = 0
print(bool(i))
print(int(True)) 
print(int(False)) 
'''

# 13、判断结果：
'''
print(3 and 9)
print(1 and 2 or 3 and 4)
'''

# 14、判断结果：
'''
print(1 > 2 and 3 or 6)
print(2**32)
print(7.6 * 1024 * 1024 * 8)
'''

# Day2作业

# 1.判断下列逻辑语句的True, False.
'''
1）1 > 1 or 3 < 4 or 4 > 5 and 2 > 1 and 9 > 8 or 7 < 6

'''

'''
2）not 2 > 1 and 3 < 4 or 4 > 5 and 2 > 1 and 9 > 8 or 7 < 6

'''

# 2.求出下列逻辑语句的值。
'''
1), 8 or 3 and 4 or 2 and 0 or 9 and 7

'''

'''
2), 0 or 2 and 3 and 4 or 6 and 0 or 3

'''

# 3.下列结果是什么？
# 1)、6 or 2 > 1
# 2)、3 or 2 > 1   #
# 3)、0 or 5 < 4   #
# 4)、5 < 4 or 3   #
# 5)、2 > 1 or 6   #
# 6)、3 and 2 > 1  #
# 7)、0 and 3 > 1  #
# 8)、2 > 1 and 3  #
# 9)、3 > 1 and 0  #

# 10)、3 > 1 and 2 or 2 < 3 and 3 and 4 or 3 > 2  #


# 4.while循环语句基本结构？
# while 条件：
#     循环体

# 5.利用while语句写出猜大小的游戏：
'''
设定一个理想数字比如：66，让用户输入数字，如果比66大，则显示猜测的结果大了；
如果比66小，则显示猜测的结果小了;
只有等于66，显示猜测结果正确，然后退出循环。
'''

# 6.在5题的基础上进行升级：
'''
给用户三次猜测机会，如果三次之内猜测对了，则显示猜测正确，退出循环，
如果三次之内没有猜测正确，则自动退出循环，并显示‘太笨了你....’。
'''

# 7.使用while循环输出

# 8.求1 - 100的所有数的和

# 9.输出1 - 100内的所有奇数

# 10.输出1 - 100内的所有偶数

# 11.求 1 - 2 + 3 - 4 + 5...99 的所有数的和

# 12.用户登录（三次输错机会）且每次输错误时显示剩余错误次数（提示：使用字符串格式化）

# 13.简述ASCII、Unicode、utf - 8编码

# 14.简述位和字节的关系？
# 8位 = 1字节


